
* sympy

#+NAME: pytest
#+BEGIN_SRC python :results output
  from sympy import *
  x = symbols('x')
  print(latex(Integral(sqrt(1/x), x)))
#+END_SRC

#+RESULTS: pytest
: \int \sqrt{\frac{1}{x}}\, dx


#+NAME: pytest2
#+BEGIN_SRC python :results output
  from sympy import *
  x = symbols('x')
  print(latex(integrate(Integral(sqrt(1/x), x))))
#+END_SRC

#+RESULTS: pytest2
: \frac{4 x^{2} \sqrt{\frac{1}{x}}}{3}


\begin{displaymath}
\frac{4 x^{2} \sqrt{\frac{1}{x}}}{3}
\end{displaymath}

CTRL + X, *, d duplicates formula:

\begin{displaymath}
\frac{4 x^{2} \sqrt{\frac{1}{x}}}{3}
\end{displaymath}


\begin{displaymath}
\frac{4 x^{2} \sqrt{\frac{1}{x}}}{3}
\end{displaymath}



